acpilight
adw-gtk-theme
alacritty
alsa-tools
alsa-utils
archlinuxarm-keyring
asahi-alarm-keyring
asahi-desktop-meta
asahi-fwextract
asahi-meta
asahi-scripts
base
base-devel
bat
bemoji
blueman
bluetui
brightnessctl
btop
bun-bin
cava
chrono-date
cliphist
docker
docker-buildx
docker-compose
espeak-ng
evtest
eza
fastfetch
fd
firefox
fuzzel
fzf
git
git-delta
github-cli
glib2-devel
glmark2
gnome-keyring
gobject-introspection
greetd
grub
gst-libav
gst-plugin-pipewire
gst-plugin-va
gst-plugins-bad
gst-plugins-base
gst-plugins-good
gst-plugins-ugly
gtklock
helium-browser-bin
helvum
hyprpicker
icu69-bin
impala
iptables-nft
iwd
lazydocker
libnotify
libxcrypt-compat
linux-asahi
linux-asahi-headers
localsend-bin
lua-language-server
luarocks
m1n1
man-db
mate-polkit
matugen
mesa-demos
mesa-utils
meson
mpv
ncdu
neovim
net-tools
networkmanager
niri
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npm
nvm
nwg-look
openssh
otf-font-awesome
pacman-contrib
papers
paru
pavucontrol
power-profiles-daemon
powertop
qalculate-gtk
qt6-multimedia-ffmpeg
ripgrep
rsync
rustup
scdoc
seahorse
speech-dispatcher
stow
strace
stremio-enhanced-bin
sudo
swaybg
swayidle
swaync
sysc-greet
tree-sitter-cli
ttf-apple-emoji
ttf-fira-code
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd
ttf-meslo-nerd-font-powerlevel10k
ttf-ms-fonts
ttf-nerd-fonts-symbols
ttf-roboto
ttf-ubuntu-sans-mono
uboot-asahi
unzip
usbutils
vesktop-bin
vim
visual-studio-code-bin
waybar
wayland-protocols
wf-recorder
wget
which
wl-clipboard
wlogout
wlr-randr
woff2-font-awesome
wtype
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk
xorg-xrandr
xwayland-satellite
yay
zed
zen-browser-bin
zoxide
zsh
zsh-theme-powerlevel10k
