aspell-ar
ghostty-git
helium-browser-bin
lexend-deca-git
libtexprintf-git
libwireplumber-4.0-compat
localsend-bin
nb
obs-studio-git
pandoc-bin
paru
qt5-location
rustdesk-bin
sioyek-git
stremio-enhanced-bin
sway-audio-idle-inhibit-git
swaylock-effects-git
ttf-amiri
ttf-ms-fonts
ttf-symbola
vesktop-git
visual-studio-code-bin
