7zip
alsa-utils
archlinuxarm-keyring
asahi-alarm-keyring
asahi-desktop-meta
asahi-fwextract
asahi-meta
asahi-scripts
aspell
aspell-en
base
base-devel
bash-completion
bat
batsignal
bc
blueprint-compiler
bluez
bluez-tools
bluez-utils
bob
brightnessctl
btop
btrfs-progs
chromium
clang
cliphist
cmake
cups
cups-filters
direnv
docker
docker-buildx
docker-compose
doxygen
ebook-tools
ex-vi-compat
expac
eza
fastfetch
fd
flatpak
fontforge
foot
fuse-overlayfs
fuzzel
fzf
fzy
ghostscript
git
github-cli
glmark2
glow
gnome-keyring
gnome-themes-extra
go
graphviz
greetd
greetd-tuigreet
grim
grub
gst-libav
gst-plugins-bad
gst-plugins-base
gst-plugins-good
gst-plugins-ugly
hunspell
hunspell-en_us
imv
iwd
jq
lazygit
libnotify
libvterm
linux-asahi
linux-firmware
lld
llvm21-libs
luacheck
luarocks
m1n1
man-db
man-pages
markdown-oxide
mesa
mesa-utils
meson
moreutils
mpv
nano
nasm
ncdu
net-tools
networkmanager
nim
ninja
niri
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
nvm
nwg-look
openssh
otf-font-awesome
pacman-contrib
pgformatter
pipewire
pipewire-alsa
pipewire-pulse
pipewire-v4l2
pkgfile
pnpm
polkit-gnome
postgresql-libs
pulsemixer
python-black
python-isort
python-pip
python-pipenv
python-pyflakes
python-pylatexenc
python-pynvim
python-pytest
qt5-quickcontrols
qt5-quickcontrols2
qt5-tools
qt5-wayland
qt6-connectivity
qt6-wayland
ranger
rate-mirrors
raylib
readest
resvg
ripgrep
rofi
rofi-calc
rsync
rustup
sane
sassc
sbcl
shfmt
slurp
snapshot
starship
stow
sudo
sway
swaybg
swayidle
swaync
swig
sysstat
systemctl-tui
television
texlive-bibtexextra
texlive-binextra
texlive-context
texlive-fontsextra
texlive-fontsrecommended
texlive-fontutils
texlive-formatsextra
texlive-games
texlive-humanities
texlive-latex
texlive-latexextra
texlive-latexrecommended
texlive-luatex
texlive-mathscience
texlive-metapost
texlive-music
texlive-pictures
texlive-plaingeneric
texlive-pstricks
texlive-publishers
texlive-xetex
tidy
tig
tldr
tmux
tree-sitter-c
tree-sitter-cli
tree-sitter-lua
tree-sitter-markdown
tree-sitter-query
tree-sitter-vim
tree-sitter-vimdoc
ttf-fira-code
ttf-jetbrains-mono
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols-mono
ttf-roboto
uboot-asahi
ueberzugpp
unrar
unzip
vale
vim
w3m
waybar
webkitgtk-6.0
wf-recorder
wget
which
wireless_tools
wiremix
wireplumber
wl-clip-persist
wl-clipboard
wlroots0.18
wlsunset
wmenu
woff2-font-awesome
xdg-desktop-portal-gnome
xdg-desktop-portal-gtk
xdg-desktop-portal-wlr
xdg-user-dirs
xwayland-satellite
yad
yarn
yasm
yq
zip
zoxide
zsh
